src/Documents/ВводСведенийОБанковскихКарточкахРаботников/ВводСведенийОБанковскихКарточкахРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводСведенийОБанковскихКарточкахРаботников</name>
  <comment>(Регл) Ввод сведений о карточках работников</comment>
  <basedOn>Document.ПриемНаРаботуВОрганизацию</basedOn>
  <registerRecords>InformationRegister.ПараметрыВыплатыЗПРаботников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботникиОрганизации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Банк</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКарточки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыплаты</name>
      <type>
        <types>EnumRef.СпособыВыплатыЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>IBAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>34</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ПараметрыВыплатыЗПРаботников/ПараметрыВыплатыЗПРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыВыплатыЗПРаботников</name>
  <comment>(Регл. Упр.)</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособВыплаты</name>
    <type>
      <types>EnumRef.СпособыВыплатыЗарплаты</types>
    </type>
  </resources>
  <resources>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>НомерКарточки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДействия</name>
    <comment>Дата окончания действия карточки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>IBAN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СпособыВыплатыЗарплаты/СпособыВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВыплатыЗарплаты</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ЧерезКассу</name>
  </enumValues>
  <enumValues>
    <name>ЧерезБанк</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ВводСведенийОБанковскихКарточкахРаботников/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Организация,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросПоРаботникиОрганизации()

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);

	ТекстЗапроса = "
	|	ВЫБРАТЬ
	|	ТЧРаботникиОрганизации.Ссылка.Дата			КАК Дата,
	|	ТЧРаботникиОрганизации.Ссылка.Организация	КАК Организация,
	|	ТЧРаботникиОрганизации.НомерСтроки,
	|	ТЧРаботникиОрганизации.Сотрудник,
	|	ТЧРаботникиОрганизации.СпособВыплаты,
	|	ТЧРаботникиОрганизации.ДатаДействия,
	|	ТЧРаботникиОрганизации.Банк,
	|	ТЧРаботникиОрганизации.НомерКарточки,
	|	ТЧРаботникиОрганизации.IBAN
	|
	|ИЗ	Документ." + Метаданные().Имя + ".РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|	
	|ГДЕ	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|	
	|";			   
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции

Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, в которой работает работник!", Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеСтрокиРаботникиОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = Локализация.СтрШаблон("В строке номер ""¤1¤"" табл. части ""Работники организации"": ", СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));
	
	// Сотрудник
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран Работник!", Отказ);
	КонецЕсли;
	
	// СпособВыплаты
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.СпособВыплаты) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан способ выплаты зарплаты!", Отказ);
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
		
		// ДатаДействия
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаДействия) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата действия карточки!", Отказ);
		КонецЕсли;
		
		// Банк
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Банк) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан банк!", Отказ);
		КонецЕсли;
		
		// НомерКарточки
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.НомерКарточки) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан номер счета карточки!", Отказ);
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

Процедура ДобавитьСтрокуПараметрыВыплатыЗПРаботников( ВыборкаПоРаботникиОрганизации )

	Движение = Движения.ПараметрыВыплатыЗПРаботников.Добавить();
	
	// Свойства
	Движение.Период				= ВыборкаПоРаботникиОрганизации.Дата;
	
	// Измерения
	Движение.Сотрудник			= ВыборкаПоРаботникиОрганизации.Сотрудник;
	Движение.Организация		= ВыборкаПоРаботникиОрганизации.Организация;
	
	// ресурсы
	Движение.СпособВыплаты		= ВыборкаПоРаботникиОрганизации.СпособВыплаты;
	Движение.Банк				= ВыборкаПоРаботникиОрганизации.Банк;
	Движение.НомерКарточки		= ВыборкаПоРаботникиОрганизации.НомерКарточки;
	Движение.ДатаДействия		= ВыборкаПоРаботникиОрганизации.ДатаДействия;
	//ИЗМЕНЕНО Верескул Игорь(Начало 17.01.2020
	Движение.IBAN				= ВыборкаПоРаботникиОрганизации.IBAN;	
	//Окончание)Верескул Игорь 
	
	
КонецПроцедуры // ДобавитьСтрокуПараметрыВыплатыЗПРаботников

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)

	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	ВыборкаПоШапкеДокумента.Следующий();
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
	
	// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
	Если НЕ Отказ Тогда
		
		// получим реквизиты табличной части
		РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизации();
		ВыборкаПоРаботникиОрганизации = РезультатЗапросаПоРаботники.Выбрать();
		
		Пока ВыборкаПоРаботникиОрганизации.Следующий() Цикл 
			
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиРаботникиОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, Отказ);
			
			Если НЕ Отказ Тогда
				
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуПараметрыВыплатыЗПРаботников( ВыборкаПоРаботникиОрганизации);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
		
		Организация = Основание.Организация;
		Ответственный = Основание.Ответственный;
		
		Для каждого ТекСтрока Из Основание.РаботникиОрганизации Цикл
			
			НоваяСтрока = РаботникиОрганизации.Добавить();
			
			НоваяСтрока.Сотрудник = ТекСтрока.Сотрудник;
			НоваяСтрока.СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу;
			
		КонецЦикла
		
	КонецЕсли;	
	
КонецПроцедуры
